In [2]:
#Different types of Date Formats


import datetime

In [4]:
t = datetime.time(1,10,20,13)

In [8]:
print(t)

01:10:20.000013

In [11]:
print('hour:', t.hour)

hour: 1

In [16]:
print('Minutes:', t.minute)

Minutes: 10

In [19]:
print('seconds:',t.second)

seconds: 20

In [22]:
print('micorsecond:',t.microsecond)

micorsecond: 13

In [28]:
import datetime

today = datetime.date.today()
print(today)

2019-09-04

In [31]:
print('ctime:', today.ctime())

ctime: Wed Sep  4 00:00:00 2019

In [33]:
print('year:',today.year)

year: 2019

In [37]:
#Convert string column to Date time using strftime
import datetime
x= datetime.datetime(2018,9,15)
print(x.strftime("%b %d %Y %H:%M:%S"))

Sep 15 2018 00:00:00

In [39]:
import datetime
x= datetime.datetime(2018,9,15)
print(x.strftime('%b/%d/%Y'))

Sep/15/2018

In [41]:
print(x.strftime('%B'))

September

In [43]:
print(x.strftime('%y'))

18

In [45]:
from datetime import datetime

str = '9-15-18'
date_object = datetime.strptime(str, '%m-%d-%y')

print(date_object)

2018-09-15 00:00:00

In [51]:
#â€¢	add a new column, delete an existing column, re-arrange columns, delete a table
import numpy as np 
import pandas as pd

data = {'country': ['Italy','Spain','Greece','France','Portugal'],
        'popu': [61, 46, 11, 65, 10],
        'percent': [0.83,0.63,0.15,0.88,0.14]}

df = pd.DataFrame(data, index=['ITA', 'ESP', 'GRC', 'FRA', 'PRT'])
df

      country  percent  popu
ITA     Italy     0.83    61
ESP     Spain     0.63    46
GRC    Greece     0.15    11
FRA    France     0.88    65
PRT  Portugal     0.14    10

In [54]:
# Rename 'popu' column to 'population'
dfnew = df.rename(columns={'popu': 'population'})
dfnew

      country  percent  population
ITA     Italy     0.83          61
ESP     Spain     0.63          46
GRC    Greece     0.15          11
FRA    France     0.88          65
PRT  Portugal     0.14          10

In [55]:
# Add a list as a new column 
dfnew['capital city'] = ['Rome','Madrid','Athens','Paris','Lisbon']
dfnew

      country  percent  population capital city
ITA     Italy     0.83          61         Rome
ESP     Spain     0.63          46       Madrid
GRC    Greece     0.15          11       Athens
FRA    France     0.88          65        Paris
PRT  Portugal     0.14          10       Lisbon

In [56]:
del dfnew['capital city']
dfnew

      country  percent  population
ITA     Italy     0.83          61
ESP     Spain     0.63          46
GRC    Greece     0.15          11
FRA    France     0.88          65
PRT  Portugal     0.14          10

In [57]:
# Get the DataFrame column names as a list
clist = list(dfnew.columns)

# Rearrange list the way you like 
clist_new = clist[-1:]+clist[:-1]   # brings the last column in the first place

# Pass the new list to the DataFrame - like a key list in a dict 
dfnew = dfnew[clist_new]
dfnew

     population   country  percent
ITA          61     Italy     0.83
ESP          46     Spain     0.63
GRC          11    Greece     0.15
FRA          65    France     0.88
PRT          10  Portugal     0.14

In [ ]:

A lambda function is a small anonymous function.

A lambda function can take any number of arguments, but can only have one expression.

lambda arguments : expression

In [59]:
x = lambda a : a + 10
print(x(5))

15

In [60]:
x = lambda a, b : a * b
print(x(5, 6))

30

In [61]:
def myfunc(n):
  return lambda a : a * n

mydoubler = myfunc(2)

print(mydoubler(11))

22

In [ ]:
# importing pandas module  
import pandas as pd 
  
# reading csv file from url  
data = pd.read_csv("https://cdncontribute.geeksforgeeks.org/wp-content/uploads/nba.csv") 
   
# dropping null value columns to avoid errors 
data.dropna(inplace = True) 
  
# storing dtype before converting 
before = data.dtypes 
  
# converting dtypes using astype 
data["Salary"]= data["Salary"].astype(int) 
data["Number"]= data["Number"].astype(str) 
  
# storing dtype after converting 
after = data.dtypes 
  
# printing to compare 
print("BEFORE CONVERSION\n", before, "\n") 
print("AFTER CONVERSION\n", after, "\n")

In [64]:
s = pd.Series(['1.0', '2', -3])
pd.to_numeric(s)

0    1.0
1    2.0
2   -3.0
dtype: float64

In [66]:
 pd.to_numeric(s, downcast='float')

0    1.0
1    2.0
2   -3.0
dtype: float32

In [69]:
pd.to_numeric(s, downcast='signed')

0    1
1    2
2   -3
dtype: int8

In [71]:
#Sort the columns, Remove the Duplicate data
import pandas as pd
import numpy as np
 
#Create a DataFrame
d = {
    'Name':['Alisa','Bobby','jodha','jack','raghu','Cathrine',
            'Alisa','Bobby','kumar','Alisa','Alex','Cathrine'],
    'Age':[26,24,23,22,23,24,26,24,22,23,24,24],
      
    'Score':[85,63,55,74,31,77,85,63,42,62,89,77]}
 
df = pd.DataFrame(d,columns=['Name','Age','Score'])
df

        Name  Age  Score
0      Alisa   26     85
1      Bobby   24     63
2      jodha   23     55
3       jack   22     74
4      raghu   23     31
5   Cathrine   24     77
6      Alisa   26     85
7      Bobby   24     63
8      kumar   22     42
9      Alisa   23     62
10      Alex   24     89
11  Cathrine   24     77

In [72]:
df.drop_duplicates()

        Name  Age  Score
0      Alisa   26     85
1      Bobby   24     63
2      jodha   23     55
3       jack   22     74
4      raghu   23     31
5   Cathrine   24     77
8      kumar   22     42
9      Alisa   23     62
10      Alex   24     89

In [74]:
# drop duplicate by a column name
 
df.drop_duplicates(['Name'], keep='last')

        Name  Age  Score
2      jodha   23     55
3       jack   22     74
4      raghu   23     31
7      Bobby   24     63
8      kumar   22     42
9      Alisa   23     62
10      Alex   24     89
11  Cathrine   24     77

In [77]:
# sort data using columns List of Tuples
students = [ ('Jack', 34, 'Sydney') ,
             ('Riti', 41, 'Delhi' ) ,
             ('Aadi', 16, 'New York') ,
             ('Riti', 22, 'Delhi' ) ,
             ('Riti', 35, 'Delhi' ) ,
             ('Riti', 40, 'Mumbai' )
              ]
 
# Create a DataFrame object
dfObj = pd.DataFrame(students, columns=['Name', 'Marks', 'City'], index=['b', 'a', 'f', 'e', 'd', 'c'])
dfObj

   Name  Marks      City
b  Jack     34    Sydney
a  Riti     41     Delhi
f  Aadi     16  New York
e  Riti     22     Delhi
d  Riti     35     Delhi
c  Riti     40    Mumbai

In [79]:
dfObj = dfObj.sort_values(by =['Name', 'Marks'])
print("Contents of a Sorted Dataframe based on multiple columns 'Name' & 'Marks' : ")
print(dfObj)

Contents of a Sorted Dataframe based on multiple columns 'Name' & 'Marks' :
   Name  Marks      City
f  Aadi     16  New York
b  Jack     34    Sydney
e  Riti     22     Delhi
d  Riti     35     Delhi
c  Riti     40    Mumbai
a  Riti     41     Delhi

In [80]:
#Impute Missing values and Handle Outliers

In [82]:
df = pd.DataFrame([('bird', 389.0),
                    ('bird', 24.0),
                   ('mammal', 80.5),                   ('mammal', np.nan)],                  index=['falcon', 'parrot', 'lion', 'monkey'],
                  columns=('class', 'max_speed'))
df

         class  max_speed
falcon    bird      389.0
parrot    bird       24.0
lion    mammal       80.5
monkey  mammal        NaN

In [84]:
df.reset_index()

    index   class  max_speed
0  falcon    bird      389.0
1  parrot    bird       24.0
2    lion  mammal       80.5
3  monkey  mammal        NaN

In [85]:
df.reset_index(drop=True)

    class  max_speed
0    bird      389.0
1    bird       24.0
2  mammal       80.5
3  mammal        NaN

In [90]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})
display(df1, df2)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [93]:

df3 = pd.merge(df1, df2)
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [94]:
orig_string = 'Hello'
orig_string + ', world'

'Hello, world'

In [99]:
full_sentence = orig_string + ', world'
full_sentence

'Hello, world'